run/benchmark/surfaceTension/advectedCircle/advectedCircle/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (-2 -0.05 -0.5)
    (2 -0.05 -0.5)
    (2 0.05 -0.5)
    (-2 0.05 -0.5)
    (-2 -0.05 0.5)
    (2 -0.05 0.5)
    (2 0.05 0.5)
    (-2 0.05 0.5)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (40 1 10) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }

    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }



    walls
    {
	type wall;
	faces
	(
            (0 3 2 1)
            (4 5 6 7)
	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
